; domain
(define (domain healthcare)

(:requirements :strips :typing :negative-preconditions :universal-preconditions)

(:types
	location
	unit - locatable
	content - locatable
	box - locatable
	patient - locatable
	robot-box - robot
	robot-patient - robot
	robot - locatable
)

(:constants 
	central_warehouse - location
	entrance - location
	scalpel tongue_depressor aspirin bandage thermometer - content
)

(:predicates
	(at ?x - locatable ?l - location)			; x is at location
	(connected ?l1 - location ?l2 - location)	; locations are connected
	
	(loaded ?r - robot ?b - box)          		; robot is carrying a box
	(unloaded ?r - robot-box)               	; robot is empty
	(empty-box ?b - box)               			; box is empty
	(filled-with ?b - box ?c - content) 		; box is filled with content 
	(unit-has-box ?u - unit ?b - box)           ; unit has a box
	(unit-has-content ?u - unit ?c - content) 	; unit has specific content
	
	(with-patient ?r - robot ?p - patient)     	; robot is with a patient
	(busy ?r - robot-patient)           		; robot is busy with a patient
	(at-unit ?p - patient ?u - unit) 			; patient is at unit
)


; (:functions)


; Both robot-box and robot-patient can move between connected locations
(:action move
	:parameters (?r - robot ?from - location ?to - location)
	:precondition (and 
		(at ?r ?from)
		(or (connected ?from ?to) (connected ?to ?from))
	)
	:effect (and 
		(at ?r ?to)
		(not (at ?r ?from))

		; we don't need to update the location of the carried box or patient
		; it is updated once it is delivered or released
		; (forall (?b - box) 
		; 	(when (loaded ?r ?b) 
		; 		(and (at ?b ?to)
		; 			(not (at ?b ?from))
		; 		)
		; 	)
		; )

		; (forall (?p - patient) 
		; 	(when (with-patient ?r ?p) 
		; 		(and (at ?p ?to)
		; 			(not (at ?p ?from))
		; 		)
		; 	)
		; )
	)
)

; Robot-box can fill a box with content
(:action fill
	:parameters (?r - robot-box ?b - box ?c - content ?l - location)
	:precondition (and 
		(at ?b ?l)
		(at ?r ?l)
		(at ?c ?l)
		(empty-box ?b)
		(= ?l central_warehouse) ; content can only be filled in the central warehouse
	)
	:effect (and 
		(filled-with ?b ?c)
		(not (empty-box ?b))
	)
)

; Robot-box can empty a box filled with content causing the unit to have that content
(:action empty
	:parameters (?r - robot-box ?b - box ?c - content ?u - unit ?l - location)
	:precondition (and 
		(at ?u ?l)
		(at ?b ?l)
		(at ?r ?l)
		(unit-has-box ?u ?b)
		(filled-with ?b ?c)
		; (not (empty-box ?b))					; redundant
		; (not (unit-has-content ?u ?c))			; necessary?
	)
	:effect (and 
		(unit-has-content ?u ?c)
		(not (filled-with ?b ?c))
		(empty-box ?b)
		(at ?c ?l)
	)
)

; Robot-box can pick up a box from a location
(:action pick-up
	:parameters (?r - robot-box ?b - box ?l - location)
	:precondition (and 
		(at ?b ?l)
		(at ?r ?l)
		(unloaded ?r)
	)
	:effect (and 
		(loaded ?r ?b)
		(not (unloaded ?r))
		(not (at ?b ?l))
	)
)


; Robot-box can deliver a box to a unit at a location
(:action deliver
		:parameters (?r - robot-box ?b - box ?l - location ?u - unit)
		:precondition (and
			(at ?r ?l)
			(at ?u ?l)

			(loaded ?r ?b)
		)
		:effect (and 
			(at ?b ?l)
			(unit-has-box ?u ?b)
			
			(not (loaded ?r ?b))
			(unloaded ?r)
		)
)

; Robot-patient can take a patient from a location, causing the robot to be busy
(:action take-patient
	:parameters (?r - robot-patient ?p - patient ?l - location)
	:precondition (and 
		(at ?r ?l)
		(at ?p ?l)
		(not (busy ?r))
	)
	:effect (and 
		(with-patient ?r ?p)
		(busy ?r)
	)
)

; Robot-patient can release a patient at a location, causing the robot to be no longer busy
(:action release-patient
	:parameters (?r - robot-patient ?p - patient ?l - location ?u - unit)
	:precondition (and 
		(at ?r ?l)
		(at ?u ?l)

		(with-patient ?r ?p)
		(busy ?r)
	)

	:effect (and 
		(at ?p ?l)
		(at-unit ?p ?u)
		
		(not (with-patient ?r ?p))
		(not (busy ?r))
	)
)
)

; problem
(define (problem problem1) (:domain healthcare)
(:objects 
    r1 - robot-box
    r2 - robot-patient
    
    b1 b2 b3 - box

    u1 u2 u3 - unit
    l1 l2 - location

    p1 p2 p3 p4 p5 - patient
)

(:init
    (at b1 central_warehouse)
    (at b2 central_warehouse)
    (at b3 central_warehouse)

    (empty-box b1)
    (empty-box b2)
    (empty-box b3)

    (at tongue_depressor central_warehouse)
    (at scalpel central_warehouse)

    (at u1 l1)
    (at u2 l2)
    (at u3 l2)

    (at r1 central_warehouse)
    (at r2 entrance)

    (unloaded r1)
    ; not (busy r2)         not needed, in STRIPS they are false by default if not specified

    (at p1 entrance)
    (at p2 entrance)
    (at p3 entrance)
    (at p4 entrance)
    (at p5 entrance)
    
    (connected entrance l1)
    (connected l1 l2)
    (connected l2 central_warehouse)
)

(:goal (and
    (unit-has-content u1 scalpel)
    (unit-has-content u2 scalpel)
    (unit-has-content u2 tongue_depressor)

    (at-unit p1 u2)
    (at-unit p2 u2)
    (at-unit p3 u3)
    (at-unit p4 u3)
    (at-unit p5 u3)
))

)

; plan
1. (take-patient r2 p1 entrance)
   added: (with-patient r2 p1) (busy r2)
   goals met: 0 of 8
2. (move r2 entrance l1)
   deleted: (at r2 entrance)
   added: (at r2 l1)
   goals met: 0 of 8
3. (move r2 l1 l2)
   deleted: (at r2 l1)
   added: (at r2 l2)
   goals met: 0 of 8
4. (release-patient r2 p1 l2 u2)
   deleted: (with-patient r2 p1) (busy r2)
   added: (at p1 l2) (at-unit p1 u2)
   goals met: 1 of 8
5. (move r2 l2 l1)
   deleted: (at r2 l2)
   added: (at r2 l1)
   goals met: 1 of 8
6. (move r2 l1 entrance)
   deleted: (at r2 l1)
   added: (at r2 entrance)
   goals met: 1 of 8
7. (take-patient r2 p2 entrance)
   added: (with-patient r2 p2) (busy r2)
   goals met: 1 of 8
8. (move r2 entrance l1)
   deleted: (at r2 entrance)
   added: (at r2 l1)
   goals met: 1 of 8
9. (move r2 l1 l2)
   deleted: (at r2 l1)
   added: (at r2 l2)
   goals met: 1 of 8
10. (release-patient r2 p2 l2 u2)
   deleted: (with-patient r2 p2) (busy r2)
   added: (at p2 l2) (at-unit p2 u2)
   goals met: 2 of 8
11. (move r2 l2 l1)
   deleted: (at r2 l2)
   added: (at r2 l1)
   goals met: 2 of 8
12. (move r2 l1 entrance)
   deleted: (at r2 l1)
   added: (at r2 entrance)
   goals met: 2 of 8
13. (take-patient r2 p3 entrance)
   added: (with-patient r2 p3) (busy r2)
   goals met: 2 of 8
14. (move r2 entrance l1)
   deleted: (at r2 entrance)
   added: (at r2 l1)
   goals met: 2 of 8
15. (move r2 l1 l2)
   deleted: (at r2 l1)
   added: (at r2 l2)
   goals met: 2 of 8
16. (release-patient r2 p3 l2 u3)
   deleted: (with-patient r2 p3) (busy r2)
   added: (at p3 l2) (at-unit p3 u3)
   goals met: 3 of 8
17. (move r2 l2 l1)
   deleted: (at r2 l2)
   added: (at r2 l1)
   goals met: 3 of 8
18. (move r2 l1 entrance)
   deleted: (at r2 l1)
   added: (at r2 entrance)
   goals met: 3 of 8
19. (take-patient r2 p4 entrance)
   added: (with-patient r2 p4) (busy r2)
   goals met: 3 of 8
20. (move r2 entrance l1)
   deleted: (at r2 entrance)
   added: (at r2 l1)
   goals met: 3 of 8
21. (move r2 l1 l2)
   deleted: (at r2 l1)
   added: (at r2 l2)
   goals met: 3 of 8
22. (release-patient r2 p4 l2 u3)
   deleted: (with-patient r2 p4) (busy r2)
   added: (at p4 l2) (at-unit p4 u3)
   goals met: 4 of 8
23. (move r2 l2 l1)
   deleted: (at r2 l2)
   added: (at r2 l1)
   goals met: 4 of 8
24. (move r2 l1 entrance)
   deleted: (at r2 l1)
   added: (at r2 entrance)
   goals met: 4 of 8
25. (take-patient r2 p5 entrance)
   added: (with-patient r2 p5) (busy r2)
   goals met: 4 of 8
26. (move r2 entrance l1)
   deleted: (at r2 entrance)
   added: (at r2 l1)
   goals met: 4 of 8
27. (move r2 l1 l2)
   deleted: (at r2 l1)
   added: (at r2 l2)
   goals met: 4 of 8
28. (release-patient r2 p5 l2 u3)
   deleted: (with-patient r2 p5) (busy r2)
   added: (at p5 l2) (at-unit p5 u3)
   goals met: 5 of 8
29. (fill r1 b3 tongue_depressor central_warehouse)
   deleted: (empty-box b3)
   added: (filled-with b3 tongue_depressor)
   goals met: 5 of 8
30. (fill r1 b2 scalpel central_warehouse)
   deleted: (empty-box b2)
   added: (filled-with b2 scalpel)
   goals met: 5 of 8
31. (pick-up r1 b3 central_warehouse)
   deleted: (unloaded r1) (at b3 central_warehouse)
   added: (loaded r1 b3)
   goals met: 5 of 8
32. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 5 of 8
33. (deliver r1 b3 l2 u2)
   deleted: (loaded r1 b3)
   added: (at b3 l2) (unit-has-box u2 b3) (unloaded r1)
   goals met: 5 of 8
34. (empty r1 b3 tongue_depressor u2 l2)
   deleted: (filled-with b3 tongue_depressor)
   added: (unit-has-content u2 tongue_depressor) (empty-box b3) (at tongue_depressor l2)
   goals met: 6 of 8
35. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 6 of 8
36. (pick-up r1 b2 central_warehouse)
   deleted: (unloaded r1) (at b2 central_warehouse)
   added: (loaded r1 b2)
   goals met: 6 of 8
37. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 6 of 8
38. (deliver r1 b2 l2 u2)
   deleted: (loaded r1 b2)
   added: (at b2 l2) (unit-has-box u2 b2) (unloaded r1)
   goals met: 6 of 8
39. (empty r1 b2 scalpel u2 l2)
   deleted: (filled-with b2 scalpel)
   added: (unit-has-content u2 scalpel) (empty-box b2) (at scalpel l2)
   goals met: 7 of 8
40. (move r1 l2 central_warehouse)
   deleted: (at r1 l2)
   added: (at r1 central_warehouse)
   goals met: 7 of 8
41. (fill r1 b1 scalpel central_warehouse)
   deleted: (empty-box b1)
   added: (filled-with b1 scalpel)
   goals met: 7 of 8
42. (pick-up r1 b1 central_warehouse)
   deleted: (unloaded r1) (at b1 central_warehouse)
   added: (loaded r1 b1)
   goals met: 7 of 8
43. (move r1 central_warehouse l2)
   deleted: (at r1 central_warehouse)
   added: (at r1 l2)
   goals met: 7 of 8
44. (move r1 l2 l1)
   deleted: (at r1 l2)
   added: (at r1 l1)
   goals met: 7 of 8
45. (deliver r1 b1 l1 u1)
   deleted: (loaded r1 b1)
   added: (at b1 l1) (unit-has-box u1 b1) (unloaded r1)
   goals met: 7 of 8
46. (empty r1 b1 scalpel u1 l1)
   deleted: (filled-with b1 scalpel)
   added: (unit-has-content u1 scalpel) (empty-box b1) (at scalpel l1)
   goals met: 8 of 8
